// other-requirements-data.js
// 其他要求数据配置 - 便于后期更改

const otherRequirementsData = {
  "required": [
    "高质量实照==超高清细节，8K分辨率，大师级作品，电影级效果，完美构图，真实的摄影作品，真实的光影，高级的质感",     
    "多层次灯光效果",
    

  ],
  "optional": [
    "毛坯房装修==将毛坯房轮廓结合要求，添加合适的家具，配饰，自由发挥设计，生成装修后的实景效果，不要看到裸露的墙面和地面，裸露的管子，不要看到裸露的顶面和呆板的色块",
    "模型AI渲染==将这张图片变成一个真实的照片，保留图片中细节和拍摄角度不变，将模型线条变为细线条，并去除多余的线条",
    "瓷砖地面==素色哑光大理石地面",   
    "木地板地面",
    "大理石地面",
    "地毯地面",    
    "塑胶地板",
    "拼花瓷砖地面",
    "正视角==正面视角（远景，不要侧面视角）",
    "远景显示",
    "全景显示",
    "侧面视角",
    "俯视角画面",
    "仰视角画面",
    "透视视角",
    "鸟瞰视角",
    "近景画面",
    "特写画面",
    "局部重色==家具的木制部分采用黑棕色竖条不明显的木纹",
    "增加丰富的软装配饰",
    "丰富的色彩",
    "强烈的对比配色",
    "相邻色搭配",
    "同色系搭配",
    "黑白灰配色",
    "豪华装修==墙面有造型，有较多暗藏灯光",
    "自然而质朴",
    "简约而高级",
    "柔和的色彩",
  ]
};